---
kind: other
id: Properties.T:Autodesk.Revit.DB.DimensionSegmentArrayIterator
source: html/5ab06de8-a229-1fec-aa76-dc02e4f39dd3.htm
---
# DimensionSegmentArrayIterator Properties

Retrieves the item that is the current focus of the iterator.